export const dates=[
  [
    '2022-01-05',
    '2022-01-04',
    '2021-12-29',
    '2021-12-05',
    '2021-01-05',
  ],
  [
    '2022-01 1주차',
    '2021-12 5주차',
    '2021-12 1주차',
    '2021-01 1주차',
  ],
  [
    '2022-01',
    '2021-12',
    '2021-01',
  ]
]

export const salesNumbers = [
  [
    '1,500만원',
    '1,243만원',
    '1,842만원',
    '943만원',
    '872만원',
  ],
  [
    '1.1억원',
    '1.4억원',
    '9,800만원',
    '1.9억원',
  ],
  [
    '22.3억원',
    '21.4억원',
    '19.8억원',
  ]
]

export const salesData = [
  [
    {
      id: 'sales',
      data: [
        {
          x: '2021-12-30',
          y: 5
        },
        {
          x: '2021-12-31',
          y: 2
        },
        {
          x: '2022-01-01',
          y: 4
        },
        {
          x: '2022-01-02',
          y: 8
        },
        {
          x: '2022-01-03',
          y: 9
        },
        {
          x: '2022-01-04',
          y: 6
        },
        {
          x: '2022-01-05',
          y: 7
        },
      ],
    },
    {
      id: 'pastmonthsales',
      data: [
        {
          x: '2021-12-30',
          z: '2021-12-23',
          y: 4
        },
        {
          x: '2021-12-31',
          z: '2021-12-24',
          y: 5
        },
        {
          x: '2022-01-01',
          z: '2021-12-25',
          y: 3
        },
        {
          x: '2022-01-02',
          z: '2021-12-26',
          y: 6
        },
        {
          x: '2022-01-03',
          z: '2021-12-27',
          y: 8
        },
        {
          x: '2022-01-04',
          z: '2021-12-28',
          y: 3
        },
        {
          x: '2022-01-05',
          z: '2021-12-29',
          y: 2
        },
      ],
    },
    {
      id: 'pastyearsales',
      data: [
        {
          x: '2021-12-30',
          z: '2021-12-23',
          y: 3
        },
        {
          x: '2021-12-31',
          z: '2021-12-24',
          y: 3
        },
        {
          x: '2022-01-01',
          z: '2021-12-25',
          y: 3
        },
        {
          x: '2022-01-02',
          z: '2021-12-26',
          y: 6
        },
        {
          x: '2022-01-03',
          z: '2021-12-27',
          y: 8
        },
        {
          x: '2022-01-04',
          z: '2021-12-28',
          y: 3
        },
        {
          x: '2022-01-05',
          z: '2021-12-29',
          y: 2
        },
      ],
    },
    {
      id: 'pastweeksales',
      data: [
        {
          x: '2021-12-30',
          z: '2021-12-23',
          y: 3
        },
        {
          x: '2021-12-31',
          z: '2021-12-24',
          y: 5
        },
        {
          x: '2022-01-01',
          z: '2021-12-25',
          y: 3
        },
        {
          x: '2022-01-02',
          z: '2021-12-26',
          y: 6
        },
        {
          x: '2022-01-03',
          z: '2021-12-27',
          y: 8
        },
        {
          x: '2022-01-04',
          z: '2021-12-28',
          y: 3
        },
        {
          x: '2022-01-05',
          z: '2021-12-29',
          y: 2
        },
      ],
    },
  ],
  [
    {
      id: 'sales',
      data: [
        {
          x: '2021-11 4주차',
          y: 2
        },
        {
          x: '2021-12 1주차',
          y: 6
        },
        {
          x: '2021-12 2주차',
          y: 9
        },
        {
          x: '2021-12 3주차',
          y: 14
        },
        {
          x: '2021-12 4주차',
          y: 12
        },
        {
          x: '2021-12 5주차',
          y: 20
        },
        {
          x: '2022-01 1주차',
          y: 7
        },
      ],
    },
    {
      id: 'pastmonthsales',
      data: [
        {
          z: '2021-10 3주차',
          y: 4,
          x: '2021-11 4주차',
        },
        {
          z: '2021-10 4주차',
          y: 5,
          x: '2021-12 1주차',
        },
        {
          z: '2021-11 1주차',
          y: 10,
          x: '2021-12 2주차',
        },
        {
          z: '2021-11 2주차',
          y: 13,
          x: '2021-12 3주차',
        },
        {
          z: '2021-11 3주차',
          y: 11,
          x: '2021-12 4주차',
        },
        {
          z: '2021-11 4주차',
          y: 30,
          x: '2021-12 5주차',
        },
        {
          z: '2021-12 1주차',
          y: 5,
          x: '2022-01 1주차',
        },
      ],
    },
    {
      id: 'pastyearsales',
      data: [
        {
          z: '2020-11 4주차',
          y: 3,
          x: '2021-11 4주차',
        },
        {
          z: '2020-12 1주차',
          y: 1,
          x: '2021-12 1주차',
        },
        {
          z: '2020-12 2주차',
          y: 7,
          x: '2021-12 2주차',
        },
        {
          z: '2020-12 3주차',
          y: 10,
          x: '2021-12 3주차',
        },
        {
          z: '2020-12 4주차',
          y: 11,
          x: '2021-12 4주차',
        },
        {
          z: '2020-12 5주차',
          y: 18,
          x: '2021-12 5주차',
        },
        {
          z: '2021-01 1주차',
          y: 14,
          x: '2022-01 1주차',
        },
      ],
    },
  ],
  [
    {
      id: 'sales',
      data: [
        {
          x: '2021-07',
          y: 23
        },
        {
          x: '2021-08',
          y: 14
        },
        {
          x: '2021-09',
          y: 26
        },
        {
          x: '2021-10',
          y: 18
        },
        {
          x: '2021-11',
          y: 29
        },
        {
          x: '2021-12',
          y: 36
        },
        {
          x: '2022-01',
          y: 17
        },
      ],
    },
    {
      id: 'pastyearsales',
      data: [
        {
          x: '2021-07',
          y: 5,
          z: '2020-07'
        },
        {
          x: '2021-08',
          y: 13,
          z: '2020-08'
        },
        {
          x: '2021-09',
          y: 30,
          z: '2020-09'
        },
        {
          x: '2021-10',
          y: 40,
          z: '2020-10'
        },
        {
          x: '2021-11',
          y: 15,
          z: '2020-11'
        },
        {
          x: '2021-12',
          y: 30,
          z: '2020-12'
        },
        {
          x: '2022-01',
          y: 11,
          z: '2021-01'
        },
      ],
    },
  ]
]

export let salesPerTimeData = [
  [
    {
      id: 'hour',
      data: []
    },
    {
      id: 'yes',
      data: []
    },
    {
      id: 'week',
      data: []
    },
    {
      id: 'month',
      data: []
    },
    {
      id: 'year',
      data: []
    },
  ],
  [
    {
      id: 'hour',
      data: []
    },
    {
      id: 'week',
      data: []
    },
    {
      id: 'month',
      data: []
    },
    {
      id: 'year',
      data: []
    },
  ],
  [
    {
      id: 'hour',
      data: []
    },
    {
      id: 'month',
      data: []
    },
    {
      id: 'year',
      data: []
    },
  ],
]

for(var i=0; i<3; i++){
  for(var j=0; j<24; j++){
    salesPerTimeData[i][0].data.push({
      x: `${j}-${j+1}시`,
      y: Math.round(Math.random()*100),
    })
  }
};

for(i=0; i<3; i++){
  for(j=0; j<24; j++){
    salesPerTimeData[i][1].data.push({
      x: `${j}-${j+1}시`,
      y: Math.round(Math.random()*100),
    })
  }
};

for(i=0; i<3; i++){
  for(j=0; j<24; j++){
    salesPerTimeData[i][2].data.push({
      x: `${j}-${j+1}시`,
      y: Math.round(Math.random()*100),
    })
  }
};

for(i=0; i<2; i++){
  for(j=0; j<24; j++){
    salesPerTimeData[i][3].data.push({
      x: `${j}-${j+1}시`,
      y: Math.round(Math.random()*100),
    })
  }
};

for(i=0; i<1; i++){
  for(j=0; j<24; j++){
    salesPerTimeData[i][4].data.push({
      x: `${j}-${j+1}시`,
      y: Math.round(Math.random()*100),
    })
  }
};

export let salesPerDayData = [
  [
    {
      id: 1,
      data: [
        {
          x: '월요일',
          y: 25,
        },
        {
          x: '화요일',
          y: 19,
        },
        {
          x: '수요일',
          y: 33,
        },
        {
          x: '목요일',
          y: 10,
        },
        {
          x: '금요일',
          y: 56,
        },
        {
          x: '토요일',
          y: 20,
        },
        {
          x: '일요일',
          y: 45,
        },
      ]
    },
    {
      id: 2,
      data: [
        {
          x: '월요일',
          y: 25,
        },
        {
          x: '화요일',
          y: 19,
        },
        {
          x: '수요일',
          y: 33,
        },
        {
          x: '목요일',
          y: 10,
        },
        {
          x: '금요일',
          y: 56,
        },
        {
          x: '토요일',
          y: 20,
        },
        {
          x: '일요일',
          y: 45,
        },
      ]
    },
    {
      id: 3,
      data: [
        {
          x: '월요일',
          y: 25,
        },
        {
          x: '화요일',
          y: 19,
        },
        {
          x: '수요일',
          y: 33,
        },
        {
          x: '목요일',
          y: 10,
        },
        {
          x: '금요일',
          y: 56,
        },
        {
          x: '토요일',
          y: 20,
        },
        {
          x: '일요일',
          y: 45,
        },
      ]
    },
    {
      id: 4,
      data: [
        {
          x: '월요일',
          y: 25,
        },
        {
          x: '화요일',
          y: 19,
        },
        {
          x: '수요일',
          y: 33,
        },
        {
          x: '목요일',
          y: 10,
        },
        {
          x: '금요일',
          y: 56,
        },
        {
          x: '토요일',
          y: 20,
        },
        {
          x: '일요일',
          y: 45,
        },
      ]
    },
  ],
  [
    {
      id: 1,
      data: [
        {
          x: '월요일',
          y: 25,
        },
        {
          x: '화요일',
          y: 19,
        },
        {
          x: '수요일',
          y: 33,
        },
        {
          x: '목요일',
          y: 10,
        },
        {
          x: '금요일',
          y: 56,
        },
        {
          x: '토요일',
          y: 20,
        },
        {
          x: '일요일',
          y: 45,
        },
      ]
    },
    {
      id: 2,
      data: [
        {
          x: '월요일',
          y: 25,
        },
        {
          x: '화요일',
          y: 19,
        },
        {
          x: '수요일',
          y: 33,
        },
        {
          x: '목요일',
          y: 10,
        },
        {
          x: '금요일',
          y: 56,
        },
        {
          x: '토요일',
          y: 20,
        },
        {
          x: '일요일',
          y: 45,
        },
      ]
    },
    {
      id: 3,
      data: [
        {
          x: '월요일',
          y: 25,
        },
        {
          x: '화요일',
          y: 19,
        },
        {
          x: '수요일',
          y: 33,
        },
        {
          x: '목요일',
          y: 10,
        },
        {
          x: '금요일',
          y: 56,
        },
        {
          x: '토요일',
          y: 20,
        },
        {
          x: '일요일',
          y: 45,
        },
      ]
    },
  ],
]

export const salesPerTimeNumbers = [
  [
    '0~1시',
    '2~3시',
    '13~14시',
    '13~14시',
    '12~13시',
  ],
  [
    '3~4시',
    '4~5시',
    '12~13시',
    '23~24시',
  ],
  [
    '4~5시',
    '6~7시',
    '7~8시',
  ]
]

export const salesPerDayNumbers = [
  [
    '월요일',
    '화요일',
    '토요일',
    '일요일',
    '수요일',
  ],
  [
    '월요일',
    '화요일',
    '토요일',
    '일요일',
  ],
  [
    '월요일',
    '화요일',
    '토요일',
  ]
]

export const revisitRatio = [
  [
    '16%',
    '23%',
    '11%',
    '12%',
    '20%'
  ],
  [
    '23%',
    '12%',
    '15%',
    '26%',
  ],
  [
    '12%',
    '35%',
    '50%'
  ],
]

const template = [
  [
    '당일 ',
    '전일 ',
    '전주 동요일 ',
    '전월 동일 ',
    '전년 동일 '
  ],
  [
    '당주 ',
    '전주 ',
    '전월 동주 ',
    '전년 동주 ',
  ],
  [
    '당월 ',
    '전월 ',
    '전년 동월',
  ],
]

export const menuTemplate = ['매출액', '평균 결제단가', '재방문자 매출 비율', '최대 매출 시간', '최대 평균 결제단가 시간', '최대 결제건수 시간', '최대 매출 요일', '최대 평균 결제단가 요일', '최대 매출 결제건수 요일'];

export let captions = [];

for(i=0; i<menuTemplate.length; i++){
  let a = []
  for(j=0; j<3; j++){
    let b = []
    for(var k=0; k<template[j].length; k++){
      b.push(template[j][k] + menuTemplate[i])
    }
    a.push(b)
  }
  captions.push(a)
}

export const comp = [
  {
    brand: '경쟁사 1',
    list: ['ㅋㅋ', 'ㅋㅋㅋ']
  },
  {
    brand: '경쟁사 2',
    list: ['ㅋㅋ', 'ㅋㅋdㅋ']
  },
  {
    brand: '경쟁사 3',
    list: ['ㅋㅋfd', 'ㅋㅋㅋ']
  },
]

export const wordList = [
  ['키워드1', '키워드2', '키워드3'],
  ['키워드1', '키워드2', '키워드3'],
  ['키워드1', '키워드2', '키워드3'],
  ['키워드1', '키워드2', '키워드3']
]
